/*****************************************************
******************************************************
**                                                  **
**  Программа вывода числового треугольника         **
**  по образцу 8,4_г                                **
**                                                  **
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Опанасенко Николай                              ** 
**  Проверил: преподаватель (прог. мод.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
int m; 
Console.Write("m = ");
m = Convert.ToInt32(Console.ReadLine());
int str; 
Console.Write("Количество строк = ");
str = Convert.ToInt32(Console.ReadLine());
int n = 1; 
for(int i = str; i != 0; i--){ 
    for(int j = n ; j <= i ; j++){ 
        

        Console.Write($"{m, 3}"); 
        m++;

    }
    m -= i + 1;
    Console.WriteLine();
}
