/*****************************************************
******************************************************
**                                                  **
**  Программа подсчёта количества цифр 3 в числе    **
**                                                  **
**                                                  **
**                                                  ** 
**  Выполнили: студенты 2 курса ЕПК гр. И-22        **
**  Данько Арина и Зосим Кирилл                     ** 
**  Проверил: преподаватель (прог. мод.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
ulong a;
ulong i = 0;
Console.Write("a = ");
a = Convert.ToUInt64(Console.ReadLine());
while(a != 0){
    if(a % 10 == 3){
        i++;
    }

    a /= 10;

}
Console.WriteLine($"Количество цифр 3 равно {i, 1:d}");