/*****************************************************
******************************************************
**                                                  **
**  11.18.Дан массив. Все его элементы:             **
**  а) уменьшить на 20                              **
**                                                  **
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Синицын Максим                                  ** 
**  Проверил: преподаватель (числ. мет.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
int n;
Console.Write("n = ");
n = Convert.ToInt32(Console.ReadLine());


int[] ar = new int[n];
Console.WriteLine("Исходный массив: ");
var r = new Random();
for (int i = 0; i < ar.Length; i++)
{
    ar[i] = r.Next(10, 20);
    Console.Write($"{ar[i], 3:d} ");
    Console.Write(" ");
}
Console.WriteLine("\nНовый массив: ");
for (int i = 0; i < ar.Length; i++)
{
    ar[i] -= 20;
    
    Console.Write($"{ar[i], 2:d} ");
    Console.Write(" ");
}
