/*****************************************************
******************************************************
**                                                  **
**  Программа для решения СЛАУ методом Гаусса.      **
**                                                  **
**  Описание входных и выходных данных:             **
**  n - размерность СЛАУ                            **
**  k, i, j — счетчики циклов;                      **
**  x[] — одномерный массив корней системы          **                          
**  a[][] — двухмерный массив матрицы СЛАУ          **
**  det — определитель матрицы                      **
**  r — временные данные                            **
**                                                  **
**  Вывод:                                          **
**  a[][]                                           **
**  x[] - уточнённый корень                         **
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр.               **
**                                                  ** 
**  Проверил: преподаватель (числ. мет.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
// НЕ ЗАБУДЬ ДОПИСАТЬ ГРУППУ И СВОЁ ИМЯ В ШАПКУ!
// НЕ ЗАБУДЬ УДАЛИТЬ ЭТИ КОМЕНТАРИИ (КРОМЕ ШАПКИ:))!
const int n = 4;
int k, i, j;
double r, det = 1.0;
double[] x = new double[n-1];
double[][] a = new double[n-1][];
// Ввод матрицы
for (k = 0; k < n-1; k++) {
    a[k] = new double[n];
    for (j = 0; j < n; j++) {
        Console.Write($"Введите a[{k}][{j}] = "); // ввод осуществляется построчно(сперва вводится 1-я строка потом 2-я и тд)
        a[k][j] = Convert.ToDouble(Console.ReadLine());
    }
}

// Вывод элементов расширенной матрицы
Console.WriteLine("\nРасширенная матрица системы:");
for (k = 0; k < n-1; k++) {
    for (j = 0; j < n; j++) {
        Console.Write($"{a[k][j],9:f4}");
    }
    Console.WriteLine();
}

// Прямой ход метода Гаусса
for (k = 0; k < n-1; k++) {
    det *= a[k][k];
    for (j = k+1; j < n; j++) {
        a[k][j] = a[k][j] / a[k][k];
    }
    for (i = k+1; i < n-1; i++) {
        for (j = k+1; j < n; j++) {
            a[i][j] = a[i][j] - a[k][j] * a[i][k];
        }
    }
}

// det
Console.WriteLine($"\ndeterminant: {det}\n");
// Обратный ход
x[n-2] = a[n-2][n-1];
for (k = n-3; k >= 0; k--) {
    r = 0;
    for (j = n-2; j >= k; j--) {
        r += a[k][j] * x[j];
    }
    x[k] = a[k][n-1]-r;
}
// Вывод результатов
for (i = 0; i < n-1; i++) {
    Console.WriteLine($"x[{i+1}] = {x[i]:f4}");
}
Console.WriteLine();