/*****************************************************
******************************************************
**                                                  **
**  Программа проверки разряда числа, нахождение    **
**  разрядов, где цифра больше 7 и вычисление их    **
**  произведения                                    **
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Синицын Максим                                  ** 
**  Проверил: преподаватель (прог. мод.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
ulong a;
ulong n = 1;
Console.Write("a = ");
a = Convert.ToUInt64(Console.ReadLine());
while(a != 0){
    if(a % 10 > 7){
        n = a % 10 * n;
    }

    a /= 10;

}
Console.WriteLine($"Произведние цифр больше 7 равно {n, 4:d}");