/*****************************************************
******************************************************
**                                                  **
**  Программа вывода квадратной матрицы по образцу  **
**  вариант 9                                       **
**                                                  **
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Опанасенко Николай                              ** 
**  Проверил: преподаватель (прог. мод.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
int m; 
Console.Write("m = ");
m = Convert.ToInt32(Console.ReadLine());
int n = 1; 
for(int i = n; i <= m; i++){ 
    for(int j = n ; j <= m ; j++){ 
       if(i == n || i == m){
        Console.Write($"{0, 3}"); 
       } else{
        if(j == n || j == m){
            Console.Write($"{0, 3}");

        } else{
            Console.Write($"{'*', 3}");
        }
       }
    }
    Console.WriteLine();
}