/*****************************************************
******************************************************
**                                                  **
**  11.3. Заполнить массив из пятнадцати элементов  **
**  случайным образом:а) вещественными значениями,  **
**  лежащими в диапазоне от 0 до 1;                 **
**                                                  **
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Синицын Максим                                  ** 
**  Проверил: преподаватель (числ. мет.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/

Console.Write("ar = \n");
var rand = new Random();
double[] ar = new double[15];
for(int i = 0; i < 15; i++) {
   ar[i] = rand.NextDouble();
   Console.Write($"{ar[i], 4:f} ");
   Console.Write(" ");
}
Console.WriteLine();
