/*****************************************************
******************************************************
**                                                  **
**  Программа вывода рисунка в консоль(домик)       **
**                                                  **
**                                                  **
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Синицын Максим                                  ** 
**  Проверил: преподаватель (прог. мод.) Фомин А. Т.**
**                                                  **
******************************************************/
string c = "*";
Console.Write($"{c, 6}\n{c, 5}{c}{c}{c, 2}{c}\n{c, 4}{c}{c}{c}{c}{c}{c}\n"
+
$"{c, 3}{c}{c}{c}{c}{c}{c}{c}\n"
+
$"{c, 2}{c}{c}{c}{c}{c}{c}{c}{c}\n"
+
$"{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}\n"
+
$"{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}\n"
+
$"{c}{c}{c}{c}{c, 4}{c}{c}{c}{c}{c}{c}{c}\n"
+
$"{c}{c}{c}{c}{c, 4}{c}{c}{c}{c}{c, 3}\n"
+
$"{c}{c}{c}{c}{c, 4}{c}{c}{c}{c}{c, 3}\n"
+
$"{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c, 3}\n"
+
$"{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}\n"
+
$"{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}{c}\n"
);