/*****************************************************
******************************************************
**  п. 7.2 "средний уровень" стр. 115.              **
**  В заданной строке заменить каждый символ строки **
**  следующим по коду                               **
**  символом. Букву «я» заменить пробелом.          **
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Синицын Максим                                  ** 
**  Проверил: преподаватель (прог. мод.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
namespace var21.p7._2 {
    internal class Program {
        static void Main(string[] args) {
            string text = "wfw asяafaя!";
            Console.WriteLine(text);
            string res = string.Empty;

            foreach (var c in text) {
                if (c != 'я') {
                    res += (char)(c + 1);
                }
                else {
                    res += " ";
                }
            }

            Console.WriteLine(res);
            Console.Read();
        }
    }
}
