/*****************************************************
******************************************************
**                                                  **
**    Задание: для всех вариантов задач             **
**    создать класс с указанными двумя              **
**    полями (Поле 1, Поле 2) и тремя методами:     **
**    - конструктор для инициализации объекта;      **
**    - функция формирования                        **
**    строки с информацией об объекте;              **
**    - функция обработки значений полей            **
**     по индивидуальному варианту.                 **
**    В основной программе вводить значения полей   **
**    каждого объекта из компонентов Edit и         **
**    выводить результаты в компонент Меmo.         **
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Синицын Максим                                  ** 
**  Проверил: преподаватель (прог. мод.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
internal class Program{
    private static void Main(string[] args){
        Calculate calculate = new Calculate(2 , 3);
        Console.WriteLine($"Сумма квадратов = {calculate.Addition()}");
        calculate.Inf();
    }
}

public class Calculate{
    readonly int a;
    readonly int b;

   public Calculate(int number1, int number2){
      a = number1;
      b = number2;
    }
   public void Inf(){
       Console.WriteLine($"Поле1 = {a}\nПоле2 = {b}");
    }
   public double Addition() {
       return Math.Pow(a, 2) +  Math.Pow(b, 2);
    }  
}