/*****************************************************
******************************************************
**                                                  **
**  Программа вывода квадратной матрицы по образцу  **
**  вариант 1                                       **
**                                                  **
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Синицын Максим                                  ** 
**  Проверил: преподаватель (прог. мод.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
int m; 
Console.Write("m = ");
m = Convert.ToInt32(Console.ReadLine());
int n = 1; 
for(int i = n; i <= m; i++){ 
    for(int j = n ; j <= m ; j++){ 
       if(i >= j){
        Console.Write($"{j, 3}"); 
       } else{
        Console.Write($"{'*', 3}");
       }
    }
    Console.WriteLine();
}

