/*****************************************************
******************************************************
**                                                  **
**  12.172. В квадратном массиве записаны           **
**  целые числа. Определить:                        **
**  в) количество нулевых элементов главной         **
**  диагонали массива;                              **
**                                                  **
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Синицын М.В                                     **
**  Проверил: преподаватель (предмет) Фомин А. Т.   **
**                                                  **
******************************************************
*****************************************************/

using MyNamespace.Matrices;
Console.Write("n = ");
int n = Convert.ToInt32(Console.ReadLine());
int[][] ar = new int[n][];
ArrMethodsMat.InputMas(ref ar, n);
ArrMethodsMat.PrintMas(ref ar, n);
ArrMethodsMat.CountZeroDiag(ref ar);
Console.WriteLine();