/***************************************************************
****************************************************************
**                                                            **
** 61) Алгоритм вычисления функции F(n) задан следующими      **
** соотношениями:                                             **
** F(n) =  n · n + 3 · n + 9, при n <= 15                     **
** F(n) = F(n–1) + n – 2, при n > 15, кратных 3               **
** F(n) = F(n–2) + n + 2, при n > 15, не кратных 3            **
** Определите количество натуральных значений n из отрезка    **
** [1; 1000], для которых все цифрызначения F(n) чётные.      **
**                                                            **
** Выполнил: студент 2 курса ЕПК гр. И-22 Опанасенко Николай  **
** Проверил: преподаватель (предмет) Фомин А. Т.              **
**                                                            **
****************************************************************
***************************************************************/
using System.Diagnostics;
static ulong F(ulong x){
    if (x<=15)
        return x * x + 3 * x + 9;
    else if (x>15 && x % 3 == 0)
            return F(x - 1) + x - 2;
        else
            return F(x - 2) + x + 2;
}
int k=0;
Stopwatch stopWatch = new Stopwatch();
stopWatch.Start();
for (uint i = 1; i < 1000; i++){
    ulong d = F(i);
    bool r=true;
    while (d != 0){
        if (d % 2 == 0){
           d /= 10;
        }else{
            r=false;
            break;
        }
    }
    if (r==true) k++;
}
stopWatch.Stop();
TimeSpan ts = stopWatch.Elapsed;
Console.WriteLine(k);
Console.WriteLine($"Прошло времени: {ts.Milliseconds} мс");