/*****************************************************
******************************************************
**                                                  **
**  Описать функцию Fib(N) целого типа,             ** 
**  вычисляющую N-й элемент по-                     **
**  следовательности чисел Фибоначчи FK,            **
**  которая описывается следующими формулами:       **
**  F1 = 1, F2 = 1, FK = FK–2 + FK–1, K = 3, 4, … . **
**  Используя функцию Fib, найти пять               **
**  чисел Фибоначчи с данными номерами N1, N2, …,N5.**
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Синицын Максим                                  ** 
**  Проверил: преподаватель (прог. мод.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
using fib;

Console.Write("Введите кол-во членов в последовательности: ");
int n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(Fibre.Fib(ref n));


