/*****************************************************
******************************************************
**                                                  **
**  Программа проверки суммы цифр числа на то       **
**  больше ли они 10                                **
**                                                  **
**                                                  ** 
**  Выполнили: студенты 2 курса ЕПК гр. И-22        **
**  Данько Арина и Зосим Кирилл                     ** 
**  Проверил: преподаватель (прог. мод.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
ulong a;
ulong sum = 0;
ulong b = 0;
Console.Write("a = ");
a = Convert.ToUInt64(Console.ReadLine());
while(a != 0){
    b = a % 10;
    sum += b;
    a /= 10;

}
if(sum > 10){
    Console.WriteLine("Верно");

} else{
    Console.WriteLine("Неверно");
}
