/*****************************************************
******************************************************
**                                                  **
**  Программа вывода числового треугольника         **
**  по образцу 8,2_б                                **
**                                                  **
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Синицын Максим                                  ** 
**  Проверил: преподаватель (прог. мод.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
int m; 
Console.Write("m = ");
m = Convert.ToInt32(Console.ReadLine());
int n = 1; 
for(int i = m; i > 0; i--){ 
    for(int j = n ; j <= i ; j++){ 

        Console.Write($"{1, 3}"); 

    }
    Console.WriteLine();
}
