/*****************************************************
******************************************************
**                                                  **
**  12.71. Дан двумерный массив целых чисел.        **
**  Определить: б) количество нечетных элементов    **
**  массива                                         **
**                                                  **
**                                                  ** 
**  Выполнил: студент 2 курса ЕПК гр. И-22          **
**  Синицын Максим                                  ** 
**  Проверил: преподаватель (числ. мет.) Фомин А. Т.**
**                                                  **
******************************************************
*****************************************************/
int n, m;
Console.Write("n = ");
n = Convert.ToInt32(Console.ReadLine());
Console.Write("m = ");
m = Convert.ToInt32(Console.ReadLine());
int odd = 0;
int[][] ar = new int[n][];
var r = new Random();
for (int i = 0; i < ar.Length; i++)
{
   ar[i] = new int[m];
   for(int j = 0; j < ar[i].Length; j++)
   {
    ar[i][j] = r.Next(10, 99);
    if(ar[i][j] % 2 != 0){
      odd++;
    }
   }
   Console.WriteLine($"Количество нечётных чисел в {i + 1, 2:d}-м массиве равно {odd, 3:d}");
   odd = 0;
}
